{
  "menuMain":"Главная",
  "mainText": "Защити свой текст",
  "mainTextDescription": "Для наглядности замененные символы выделены другим цветом.",
  "insertYourText": "Исходный текст",
  "insertYourTextInsertStatus": "вставлено",
  "сonvertedText": "Преобразованный текст",
  "сonvertedTextСopied": "скопировано",
  "howItWorks": "Как это работает:",
  "howItWorksP1": "Символы языка, который вы используете при печати, содержатся в таблице Unicode. Символы, используемые в вашем языке, занимают определенный диапазон таблицы Unicode. Таблица Unicode включает символы почти всех письменных языков мира. Также в этой таблице есть символы, которые выглядят похоже или которые можно одинакова понять из-за из внешнего сходства.",
  "howItWorksP2": "Основная идея состоит в том, чтобы заменить символы в вашем тексте другими символами из кодовой таблицы, которые выглядят такими же или похожими. После обработки внешний вид текста может измениться, но смысл не потеряется. После замены символов ваш текст останется читаемым для человека, но обработка его различными системами будет значительно затруднена.",
  "howItWorksP3":"P.S. На данный момент поддерживаются символы латиницы и кириллицы. Это означает, что символы не входящие в латинский и кириллический алфавиты будут пропущены, и в окончательном варианте они будут отображаться в исходном виде.",
  "inputTextAria": "Напиши/вставь сюда любой текст",
  "applicationAreaHeader": "Область применения:",
  "applicationAreaLi1": "Усложнение поиска по тексту: обработанный текст будет сложно найти (по сути, это уже будут другие слова, состоящие из букв разных алфавитов). Например: если вы оставите комментарий с таким текстом, его будет сложно найти. Такой текст в целом будет очень плохо индексироваться, скорее всего, такой текст не будет индексироваться в поисковых системах.",
  "applicationAreaLi2": "Обход цензуры: обработанный текст сложно модерировать. При использовании различных инструментов цензуры текста сравнивается текст с шаблонным тестом, вероятность найти обработанный текст в шаблонах невелика. Весьма вероятно, что текст пройдет фильтр цензуры, если разработчик фильтра не учел такие методы обхода."
}